In [1]:
from datetime import datetime, date
import pandas as pd

In [2]:
pd.__version__

'1.3.2'

## inline date elements

In [3]:
from datetime import date
import pandas as pd

df = pd.DataFrame({
    "name":          ["alice",        "bob",            "charlie"],
    "date_of_birth": [date(1999,4,1), date(2001,12,15), date(1985,4,24)] 
})

## pandas timestamp now

In [4]:
df = pd.DataFrame({
    "name":["alice","bob","charlie", "david"],
    "age":[12,43,22,34]
})
df

      name  age
0    alice   12
1      bob   43
2  charlie   22
3    david   34

In [5]:
df["time"] = pd.Timestamp(datetime.now())
df

      name  age                       time
0    alice   12 2022-05-05 00:46:43.273572
1      bob   43 2022-05-05 00:46:43.273572
2  charlie   22 2022-05-05 00:46:43.273572
3    david   34 2022-05-05 00:46:43.273572

## timestamp to string

In [6]:
df = pd.DataFrame({
    "name":["alice","bob","charlie", "david"],
    "age":[12,43,22,34]
})

df["timestamp_col"] = pd.Timestamp(datetime.now())
df

      name  age              timestamp_col
0    alice   12 2022-05-05 00:46:43.285148
1      bob   43 2022-05-05 00:46:43.285148
2  charlie   22 2022-05-05 00:46:43.285148
3    david   34 2022-05-05 00:46:43.285148

In [7]:
df["formatted_col"] = df["timestamp_col"].map(lambda ts: ts.strftime("%d-%m-%Y"))

df

      name  age              timestamp_col formatted_col
0    alice   12 2022-05-05 00:46:43.285148    05-05-2022
1      bob   43 2022-05-05 00:46:43.285148    05-05-2022
2  charlie   22 2022-05-05 00:46:43.285148    05-05-2022
3    david   34 2022-05-05 00:46:43.285148    05-05-2022


## group by year

In [8]:
import pandas as pd

df = pd.DataFrame({
    'name': ['alice','bob','charlie', 'david'],
    'date_of_birth': ['2001-05-27','1999-02-16','1998-09-25', '1999-01-01']
})

df['date_of_birth'] = pd.to_datetime(df['date_of_birth'])

# step 1: create a 'year' column
df['year_of_birth'] = df['date_of_birth'].map(lambda dt: dt.strftime('%Y'))

# step 2: group by the created columns
grouped_df = df.groupby('year_of_birth').size()

grouped_df.to_frame('count').reset_index()

  year_of_birth  count
0          1998      1
1          1999      2
2          2001      1


## group by start of week

In [9]:
from datetime import timedelta

import pandas as pd

df = pd.DataFrame({
    'item':          ['a',          'b',         'c',         'd',          'e',          'f'],
    'purchase_date': ['2001-01-15', '2001-01-18','2001-01-21','2001-01-24', '2001-01-27', '2001-01-30']
})

# convert values to datetime type
df['purchase_date'] = pd.to_datetime(df['purchase_date'])


df['purchase_start_of_week'] = df['purchase_date'].map(lambda dt: dt - timedelta(days=dt.weekday()))

grouped_df = df.groupby('purchase_start_of_week').size()

grouped_df.to_frame('count').reset_index()

  purchase_start_of_week  count
0             2001-01-15      3
1             2001-01-22      2
2             2001-01-29      1